
{
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_1",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "input_shape": [224, 224, 3]
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Flatten",
            "config": {}
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 1,
              "activation": "sigmoid"
            }
          }
        ]
      }
    },
    "weightsManifest": [
      {
        "paths": ["group1-shard1of1.bin"],
        "weights": [
          {"name": "conv2d_1/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"},
          {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32"},
          {"name": "dense_1/kernel", "shape": [5408, 1], "dtype": "float32"},
          {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}
        ]
      }
    ],
    "format": "layers-model",
    "generatedBy": "TensorFlow.js v3.18.0",
    "convertedBy": null
  }